import React from 'react';
import image1 from '../images/news1.jpg';
import image2 from '../images/news2.jpg';
import image3 from '../images/news3.jpg';
import image4 from '../images/news4.jpg';
import image5 from '../images/news5.jpg';
import image6 from '../images/news6.jpg';
import image7 from '../images/news7.jpg';
import image8 from '../images/news8.jpg';
import image9 from '../images/news9.jpg';
import image10 from '../images/news10.jpg';

const news = [
  { title: 'Києво-Печерська лавра', image: image1, description: 'Києво-Печерська лавра — це одне з найбільш визначних та святинних місць України, яке знаходиться у столиці країни, місті Київ. Лавра відома своєю довголітньою історією, яка налічує понад тисячу років, і стала центром православної віри та культури. Цей монастирський комплекс складається з численних храмів, музеїв, монастирських будівель та давніх печерних монастирів, в яких зберігаються реліквії святих, архівні документи та ікони, відомі своєю духовною цінністю. Одним із символів Києво-Печерської лаври є Успенський собор, висота якого досягає 96 метрів і який видно з різних точок міста. Цей собор є одним з найвищих та найбільш вражаючих архітектурних шедеврів України.'},
  { title: 'Львівський історичний центр', image: image2, description: 'Львівський історичний центр — це витончена перлина архітектурної краси та культурної спадщини, яка знаходиться в самому серці міста Львів, що на заході України. Заснований у XIII столітті, цей історичний район міста вражає своєю атмосферою давнього величчя та неповторним колоритом. Поєднання різних архітектурних стилів — від готики та бароко до ренесансу та модерну — робить Львівський історичний центр неповторним. Вузькі вулички, величезні площі, витончені кафедральні і церковні споруди, а також розкішні палаці та крамниці створюють атмосферу, що переносить відвідувачів у часи минулого. Тут можна знайти багато видатних архітектурних пам\'яток, серед яких Собор Святого Юра, Домініканський костел, Ратуша, Львівський оперний театр, Личаківське кладовище та багато інших.'},
  { title: 'Софіївський собор', image: image3, description: 'Софіївський собор – це один з найвизначніших пам\'ятників культурної спадщини України, розташований у серці столиці, місті Київ. Собор є символом духовної сили та величі української історії. Будівництво Софіївського собору розпочалося у XI столітті за наказом княгині Ольги та її онука князя Ярослава Мудрого. Собор був заснований як частина Софіївського монастиря, який був важливим центром православної віри та культури. Архітектурно Софіївський собор вражає своєю величчю та красою. Його стіни прикрашені чудовими мозаїками та фресками, що розповідають історії Біблії та життя святих. Він є символом віри, мудрості та краси, що привертає до себе тисячі відвідувачів, бажаючих пізнати його велич та духовну енергію.'},
  { title: 'Палац Потоцьких', image: image4, description: 'Палац графів Потоцьких – це справжня архітектурна перлина Львова. Цю будівлю зводили в останній декаді ХІХ століття як резиденцію Альфреда Юзефа Потоцького. Той був австрійським політиком, намісником цісаря в Галичині. Граф Потоцький захоплювався Францією, тому його палац у Львові будували за зразком резиденцій часів короля Луї XIV. Після приходу до Львова радянської влади Потоцькі залишили місто і більше не поверталися. У палаці функціонували дослідницькі інститути, а з 1975 року міський РАЦС. Врешті, у 2002 році цю споруду передали галереї мистецтв. Сьогодні у Палаці Потоцьких можна ознайомитись з європейським живописом XVI – XVIII ст., але також цю будівлю використовують як резиденцію Президента України.'},
  { title: 'Печера "Оптимістична"', image: image5, description: 'Печера "Оптимістична" знаходиться в Тернопільській області та вважається найдовшою гіпсовою печерою у всьому світі, тому її навіть занесли до Книги рекордів Гіннеса. Довжина ходів достеменно невідома, сьогодні говорять про цифри 213-267 км, хоча дослідники зазначають, що вивчено близько 15% ходів. В підземному світі цього унікального місця панує захоплива атмосфера, яку неможливо передати за допомогою фотографій. Екскурсійні бюро пропонують різні рівні складності маршрутів - від звичайних пізнавальних до більш екстремальних. Більше дізнатися про них можна в Інтернеті, щоб обрати найкращий варіант для своєї подорожі. Під час екскурсії туристи матимуть змогу добре роздивлятися гіпсові кристали різноманітних форм, розмірів та кольорів.'},
  { title: 'Ворохта', image: image6, description: 'Ворохта — високогірний курорт, 850 м над рівнем моря, лежить у верхів\'ї р. Прут, на території Карпатського природного національного парку. За легендою назва походить від прізвища солдата-дезертира, який оселився тут у XVII ст. Знайдені археологами кремінні знаряддя праці свідчать про те, що територію було заселено і раніше. Ворохта відома як центр зимових видів спорту. Тут є комплекс чотирьох трамплінів з витягом, що завдяки штучному покриттю діють цілорічно, а також канатно-крісельна дорога довжиною 2 км (зараз на реконструкції). До Ворохти належить спортивна база "Заросляк" (21 км від центру селища), звідки починається сходження на Говерлу. Ворохта — ще й відомий кліматичний курорт. Знижений атмосферний тиск, чисте, прозоре повітря, підвищений вміст озону й насиченість фітонцидами сприяють лікуванню захворювань органів дихання.'},
  { title: 'Озеро Синевир', image: image7, description: 'Озеро Синевир — це неперевершений природний об\'єкт, розташований в Карпатах на висоті 989 м над рівнем моря. Займаючи вражаючу площу близько 4-5 га, маючи максимальну глибину у 22-25 метрів, озеро відзначається своєю кришталево-чистотою водою та захоплюючою природою навколо. Воно є "серцем" Національного однойменного природного парку "Синевир". Отримавши популярність як туристичний об\'єкт, озеро щороку приваблює тисячі відвідувачів, які прагнуть насолодитися природними багатствами Карпат. За сезонами змінюються і його обличчя: влітку тут розквітає яскрава рослинність, навесні й восіни воно вражає кольоровою палітрою. Його води, оточені гірськими вершинами, створюють унікальну атмосферу, яка залишає невимовно яскраві враження у всіх, хто має щастя відвідати це чарівне місце.'},
  { title: 'Аккерманська фортеця', image: image8, description: 'Аккерманська фортеця, також відома як Білгород-Дністровська, розташована в однойменному місті Білгород-Дністровськ (античне місто Тіра) на півдні України. Фортеця має давню історію, відзначаючись впливом різних епох, таких як римська, візантійська та османська. Її архітектурний стиль поєднує різноманітні елементи та вражаючу систему оборонних стін і веж протяжністю 2.5 кілометри, вона займає площу майже 9 гектарів. Розташування фортеці на високому пагорбі над Дністровським лиманом давало їй стратегічну перевагу в історичних конфліктах. Фортеця грала важливу роль в історії регіону, функціонуючи як ключовий об\'єкт оборони та адміністративний центр, зокрема під час османського володарювання. Сьогодні вона є туристичною атракцією та об\'єктом культурної спадщини України, приваблюючи відвідувачів своєю величчю та красою.'},
  { title: 'Національний дендропарк "Софіївка"', image: image9, description: 'Національний дендрологічний парк "Софіївка" — це один з найкращих прикладів паркового мистецтва та ландшафтного дизайну в Україні. Його площя сягає 179.6 гектарів. Розташований у місті Умань, Черкаська область, цей парк приваблює відвідувачів своєю красою, різноманіттям рослинного світу та історією. Парк був заснований у 1796 році магнатом Станіславом Щенсним Потоцьким, власником Уманського маєтку, який назвав його на честь своєї дружини Софії. Цей об\'єкт є одним з найстаріших парків України.Парк "Софіївка" славиться своїм унікальним ландшафтним дизайном. Тут зустрічаються елементи англійського садового мистецтва, стилізовані фігури, газони, водойми та архітектурні композиції. Природний об\'єкт є справжнім скарбом для ботаніків та любителів рослин.'},
  { title: 'Національний заповідник "Хортиця"', image: image10, description: 'Хортиця – місце унікальне, овіяне легендами, міфами і переказами різних епох. Тут піднімаються на земну поверхню граніти, вік яких перевищує 2,5 мільярда років, саме тут знаходяться кургани – ровесники єгипетських пірамід і стародавні храми – кромлехи. Це місце сили, куди тисячі людей приходять підзарядиться життєвою енергією, а «Запорозька Січ» - символ епохи козацької вольниці, військової доблесті і самобутності українського народу. Хортиця – найбільший острів на Дніпрі (площа 23,59 кв. км), розташований трохи нижче греблі ДніпроГЕСу. Його довжина з північного заходу на південний схід - 12,5 км, а середня ширина - близько 2,5 км. Острів добре видно з прибережних територій центральних районів Запоріжжя.'},
];

const News = () => {
  return (
    <div id="news" className="container-fluid mt-4 main-div">
      <h2 className='text-center'>Головні новини</h2>
      <div className="row">
        {news.map((item, index) => (
          <div key={index} className={`col-md-12 mb-3`}>
            <div className="card">
              <div className="row no-gutters align-items-center">
                {index % 2 === 0 ? (
                  <>
                    <div className="col-md-6">
                      <div className="card-body">
                        <h5 className='text-center'>{item.title}</h5>
                        <p className='p-text'>{item.description}</p>
                      </div>
                    </div>
                    <div className="col-md-6 d-flex justify-content-end">
                      <img src={item.image} className="card-img" alt={item.title} />
                    </div>
                  </>
                ) : (
                  <>
                    <div className="col-md-6">
                      <img src={item.image} className="card-img " alt={item.title} />
                    </div>
                    <div className="col-md-6">
                      <div className="card-body">
                        <h5 className='text-center'>{item.title}</h5>
                        <p className='p-text'>{item.description}</p>
                      </div>
                    </div>
                  </>
                )}
              </div>
            </div>
          </div>
        ))}
      </div>
    </div>
  );
};


export default News;
