import React from 'react';
import aboutImage from '../images/about.jpg';

const Content = () => {
    return (
        <div className="container">
            <div className="row">
                <div className="col-md-12">
                    <h1 className="text-center">Про сайт</h1>
                    <p>
                        Ласкаво просимо на наш сайт, призначений для вивчення та відкриття найвидатніших туристичних місць України.
                        Наша мета – збирати та представляти об'єктивну та детальну інформацію про найважливіші культурні, історичні
                        та природні об'єкти нашої країни. Ми прагнемо створити джерело, що надійно і повно описує усі перлини України
                        для тих, хто прагне пізнати та вивчати нашу культурну та природну спадщину.
                    </p>
                </div>
            </div>
            <div className="row">
                <div className="image-container col-md-12">
                    <img src={aboutImage} alt='about' className="content-image mb-3" />
                </div>
            </div>
            <div className="row">
                <div className="col-md-12">
                    <h2 className='text-center'>Історія проекту</h2>
                    <p>
                        Ідея створення сайту виникла з бажання зібрати унікальну та вичерпну інформацію про найцікавіші місця нашої
                        країни та поділитися нею з усіма, хто цікавиться відкриттями та подорожами. На початкових етапах розвитку ми
                        вкладали багато зусиль у створення першокласного інформаційного ресурсу, який би став надійним джерелом для
                        тих, хто прагне дізнатися більше про туристичні атракції України. Ми збирали та обробляли інформацію, шукали
                        цікаві факти та історії, робили фотографії, щоб зробити наш сайт якісним та цікавим для
                        відвідувачів. Протягом часу наш проект зазнавав змін та вдосконалень, але наша мета залишалася незмінною
                        – збирати та представляти найбільш повну та об'єктивну інформацію про туристичні об'єкти України.
                    </p>
                </div>
            </div>
        </div>
    );
};

export default Content;







